;;; 10-minor-frame.el --- 設定 - マイナーモード - フレーム -*- lexical-binding: t; -*-

;; Copyright (C) 2013-2019 Taku Watabe
;; Time-stamp: <2019-01-22T20:44:32+09:00>

;;; Commentary:

;;; Code:


;; ----------------------------------------------------------------------------
;; デフォルト値
;; ----------------------------------------------------------------------------
(custom-set-variables
 ;;
 ;; フレームサイズ変更を px 単位で実行できるようにする
 ;;
 '(frame-resize-pixelwise t))


;; ----------------------------------------------------------------------------
;; 起動
;; ----------------------------------------------------------------------------
(eval-after-load 'frame
  '(if (fboundp 'blink-cursor-mode)
       ;;
       ;; カーソルは点滅させない
       ;;
       (blink-cursor-mode -1)))


;; ----------------------------------------------------------------------------
;; Local Variables:
;; coding: utf-8-unix
;; mode: Emacs-Lisp
;; no-byte-compile: t
;; End:

;;; 10-minor-frame.el ends here
