;;; 10-minor-flymake.el --- 設定 - マイナーモード - 自動静的解析ランナー

;; Copyright (C) 2018 Taku Watabe
;; Time-stamp: <2018-12-25T14:23:21+09:00>

;;; Commentary:

;;; Code:

;; ----------------------------------------------------------------------------
;; デフォルト値
;; ----------------------------------------------------------------------------
;; TODO: temp ファイルを即時消去できるようにするか、
;;       別の場所に生成するようにしたい


;; ----------------------------------------------------------------------------
;; Local Variables:
;; coding: utf-8-unix
;; mode: Emacs-Lisp
;; no-byte-compile: t
;; End:

;;; 10-minor-flymake.el ends here
