;;; 10-minor-org.el --- 設定 - マイナーモード - アウトライン編集など

;; Copyright (C) 2013-2015 Taku Watabe
;; Time-stamp: <2015-02-12T14:00:05+09:00>

;;; Commentary:

;; TODO: 未設定。

;;; Code:

;; ----------------------------------------------------------------------------
;; デフォルト値
;; ----------------------------------------------------------------------------
;; (eval-after-load 'org
;;   '(progn
;;      ))


;; ----------------------------------------------------------------------------
;; Local Variables:
;; coding: utf-8-unix
;; mode: Emacs-Lisp
;; no-byte-compile: t
;; End:

;;; 10-minor-org.el ends here
