;;; 20-major-vue.el --- 設定 - メジャーモード - Vue.js -*- lexical-binding: t; -*-

;; Copyright (C) 2019 Taku Watabe
;; Time-stamp: <2019-01-30T15:34:45+09:00>

;;; Commentary:

;;; Code:

(if (not (package-installed-p 'vue-mode))
    (package-install 'vue-mode))


;; ----------------------------------------------------------------------------
;; デフォルト値
;; ----------------------------------------------------------------------------
;; EMPTY


;; ----------------------------------------------------------------------------
;; 初期化
;; ----------------------------------------------------------------------------
;; EMPTY


;; ----------------------------------------------------------------------------
;; Local Variables:
;; coding: utf-8-unix
;; mode: Emacs-Lisp
;; no-byte-compile: t
;; End:

;;; 20-major-vue.el ends here
